Repository: WPPlugins/custom-upload-folders
Catalog: languages/bfcuf-*.po
Languages: es_es, pt_br

source: Custom Upload Folders
es_es: Carpeta Personalizada de Uploads
pt_br: Diretório Personalizado de Uploads

source: Organize the uploads by Year-Month-Day, File Type, Post ID or Author display name.
es_es: Organiza tus uploads por tipo de archivo, ID del post, nombre público del autor o Año-Mes-Día.
pt_br: Organize seus uploads por tipo de arquivo, ID do post, nome público do autor ou Ano-Mes-Dia.

source: By Post ID
es_es: Por ID de la Entrada
pt_br: Por ID do Post

source: By Post Slug
es_es: Por Slug de la Entrada
pt_br: Por Slug do post

source: By Author
es_es: Por Autor
pt_br: Por Autor

source: By File Type
es_es: Por Tipo de Archivo
pt_br: Por Tipo de Arquivo

source: By Year Month Day
es_es: Por Año Mes Día
pt_br: Por Ano Mês Dia

source: -none-
es_es: -ninguna-
pt_br: -nenhuma-

source: Some configurations (even not organizing by Year/Month) are not recommended if your site has thousands of images.
es_es: Algunos ajustes (hasta no organizar por Año/Mes) no son recomendadas si tu site tiene miles de imágenes.
pt_br: Algumas configurações (até simplesmente não organizar por Ano/Mes) não são recomendadas se seu site tem milhares de imagens/arquivos.

source: In this case, it's better to use ID, Slug or Date structures.
es_es: En ese caso, es mejor usar una estructura de ID, Slug o Fecha.
pt_br: Nesse caso, é melhor usar uma estrutura de ID, Slug ou Data.

source: Having "Organize by Month Year" enabled, will make the structure like:
es_es: A opción "Por Año Mes Día" hace con que la estructura sea:
pt_br: A opção "Por Ano Mês Dia" faz com que estrutura seja:

source: /uploads/custom-folder/year-month/
es_es: /uploads/carpeta-personalizada/ano-mes/
pt_br: /uploads/diretorio-personalizado/ano-mes/

source: Settings
es_es: Ajustes
pt_br: Ajustes
